# GetAllRevisionIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheet..::..GetAllRevisionIds Method
ViewSheet Class See Also
---
Gets the ordered array of Revisions which participate in the sheet's revision schedules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<ElementId> GetAllRevisionIds()
```

Visual Basic
---
```text
Public Function GetAllRevisionIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetAllRevisionIds()
```

# ### Return Value
The ordered array of ids of Revisions participating in the sheet's revision schedules.
# Remarks
The Revisions are ordered according to the revision sequence in the project. A Revision is considered to be participating in revision scheduling on the sheet if either a revision cloud belonging to that Revision is visible on the sheet or the Revision has been explicitly included using the Revisions On Sheet parameter.
# See Also
ViewSheet Class
Autodesk.Revit.DB Namespace